; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=280, out_folder=./training, instance_id=16, seed=2040, goal_proportion=0.03

(define (problem blocksworld-16)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 b199 b200 b201 b202 b203 b204 b205 b206 b207 b208 b209 b210 b211 b212 b213 b214 b215 b216 b217 b218 b219 b220 b221 b222 b223 b224 b225 b226 b227 b228 b229 b230 b231 b232 b233 b234 b235 b236 b237 b238 b239 b240 b241 b242 b243 b244 b245 b246 b247 b248 b249 b250 b251 b252 b253 b254 b255 b256 b257 b258 b259 b260 b261 b262 b263 b264 b265 b266 b267 b268 b269 b270 b271 b272 b273 b274 b275 b276 b277 b278 b279 b280 - object)
 (:init 
    (arm-empty)
    (clear b241)
    (on-table b241)
    (clear b256)
    (on b256 b172)
    (on b172 b5)
    (on b5 b126)
    (on-table b126)
    (clear b233)
    (on b233 b102)
    (on b102 b261)
    (on-table b261)
    (clear b45)
    (on b45 b38)
    (on-table b38)
    (clear b244)
    (on b244 b47)
    (on b47 b46)
    (on-table b46)
    (clear b139)
    (on b139 b27)
    (on b27 b222)
    (on b222 b94)
    (on-table b94)
    (clear b250)
    (on b250 b188)
    (on b188 b37)
    (on b37 b49)
    (on b49 b156)
    (on b156 b106)
    (on b106 b51)
    (on b51 b274)
    (on b274 b14)
    (on b14 b17)
    (on-table b17)
    (clear b61)
    (on b61 b185)
    (on b185 b2)
    (on b2 b75)
    (on-table b75)
    (clear b114)
    (on b114 b259)
    (on b259 b237)
    (on-table b237)
    (clear b273)
    (on b273 b141)
    (on b141 b53)
    (on b53 b110)
    (on b110 b124)
    (on-table b124)
    (clear b10)
    (on b10 b159)
    (on-table b159)
    (clear b224)
    (on-table b224)
    (clear b31)
    (on b31 b257)
    (on b257 b279)
    (on b279 b41)
    (on-table b41)
    (clear b221)
    (on b221 b96)
    (on b96 b264)
    (on b264 b73)
    (on b73 b95)
    (on b95 b142)
    (on b142 b136)
    (on b136 b29)
    (on b29 b177)
    (on b177 b8)
    (on b8 b80)
    (on-table b80)
    (clear b164)
    (on-table b164)
    (clear b12)
    (on-table b12)
    (clear b59)
    (on-table b59)
    (clear b117)
    (on b117 b125)
    (on-table b125)
    (clear b137)
    (on b137 b246)
    (on b246 b176)
    (on b176 b272)
    (on-table b272)
    (clear b245)
    (on b245 b104)
    (on b104 b69)
    (on b69 b97)
    (on b97 b30)
    (on b30 b91)
    (on-table b91)
    (clear b20)
    (on b20 b219)
    (on b219 b113)
    (on b113 b123)
    (on b123 b129)
    (on-table b129)
    (clear b226)
    (on b226 b251)
    (on b251 b242)
    (on b242 b225)
    (on b225 b173)
    (on b173 b194)
    (on b194 b178)
    (on-table b178)
    (clear b150)
    (on b150 b207)
    (on b207 b146)
    (on-table b146)
    (clear b9)
    (on b9 b25)
    (on b25 b163)
    (on b163 b35)
    (on-table b35)
    (clear b32)
    (on b32 b213)
    (on-table b213)
    (clear b189)
    (on b189 b88)
    (on b88 b24)
    (on-table b24)
    (clear b193)
    (on b193 b174)
    (on-table b174)
    (clear b78)
    (on-table b78)
    (clear b195)
    (on b195 b148)
    (on b148 b21)
    (on b21 b65)
    (on b65 b266)
    (on-table b266)
    (clear b56)
    (on-table b56)
    (clear b109)
    (on b109 b175)
    (on-table b175)
    (clear b191)
    (on b191 b217)
    (on b217 b192)
    (on b192 b169)
    (on b169 b206)
    (on b206 b228)
    (on b228 b72)
    (on b72 b130)
    (on b130 b271)
    (on b271 b138)
    (on b138 b103)
    (on-table b103)
    (clear b11)
    (on b11 b145)
    (on b145 b68)
    (on-table b68)
    (clear b58)
    (on b58 b265)
    (on-table b265)
    (clear b108)
    (on-table b108)
    (clear b161)
    (on b161 b238)
    (on b238 b147)
    (on b147 b180)
    (on b180 b36)
    (on b36 b197)
    (on b197 b184)
    (on-table b184)
    (clear b203)
    (on b203 b111)
    (on b111 b120)
    (on b120 b155)
    (on b155 b205)
    (on b205 b63)
    (on-table b63)
    (clear b278)
    (on b278 b105)
    (on b105 b162)
    (on b162 b100)
    (on-table b100)
    (clear b132)
    (on b132 b160)
    (on b160 b134)
    (on b134 b236)
    (on-table b236)
    (clear b71)
    (on-table b71)
    (clear b167)
    (on b167 b157)
    (on b157 b116)
    (on b116 b280)
    (on b280 b229)
    (on b229 b220)
    (on b220 b153)
    (on b153 b121)
    (on b121 b84)
    (on b84 b231)
    (on b231 b183)
    (on b183 b67)
    (on b67 b62)
    (on b62 b133)
    (on-table b133)
    (clear b89)
    (on b89 b152)
    (on b152 b3)
    (on b3 b83)
    (on b83 b4)
    (on b4 b39)
    (on b39 b34)
    (on b34 b267)
    (on b267 b252)
    (on b252 b98)
    (on b98 b54)
    (on b54 b44)
    (on-table b44)
    (clear b204)
    (on b204 b90)
    (on b90 b240)
    (on b240 b40)
    (on-table b40)
    (clear b243)
    (on b243 b198)
    (on b198 b269)
    (on b269 b115)
    (on b115 b93)
    (on-table b93)
    (clear b227)
    (on b227 b208)
    (on b208 b18)
    (on b18 b186)
    (on b186 b128)
    (on-table b128)
    (clear b144)
    (on b144 b99)
    (on-table b99)
    (clear b70)
    (on b70 b50)
    (on b50 b218)
    (on-table b218)
    (clear b200)
    (on b200 b201)
    (on-table b201)
    (clear b254)
    (on b254 b81)
    (on b81 b211)
    (on b211 b33)
    (on b33 b214)
    (on b214 b199)
    (on-table b199)
    (clear b52)
    (on-table b52)
    (clear b76)
    (on b76 b60)
    (on b60 b187)
    (on-table b187)
    (clear b253)
    (on b253 b26)
    (on b26 b57)
    (on b57 b140)
    (on b140 b119)
    (on b119 b248)
    (on b248 b216)
    (on b216 b19)
    (on-table b19)
    (clear b28)
    (on-table b28)
    (clear b168)
    (on b168 b112)
    (on b112 b171)
    (on-table b171)
    (clear b149)
    (on b149 b143)
    (on b143 b77)
    (on-table b77)
    (clear b122)
    (on b122 b16)
    (on b16 b232)
    (on b232 b260)
    (on-table b260)
    (clear b101)
    (on b101 b239)
    (on b239 b154)
    (on-table b154)
    (clear b66)
    (on b66 b127)
    (on b127 b85)
    (on b85 b55)
    (on-table b55)
    (clear b79)
    (on b79 b92)
    (on b92 b131)
    (on b131 b223)
    (on b223 b215)
    (on b215 b210)
    (on b210 b247)
    (on-table b247)
    (clear b107)
    (on b107 b15)
    (on b15 b277)
    (on b277 b275)
    (on-table b275)
    (clear b151)
    (on b151 b74)
    (on b74 b158)
    (on b158 b64)
    (on b64 b276)
    (on b276 b230)
    (on b230 b43)
    (on b43 b234)
    (on b234 b270)
    (on-table b270)
    (clear b165)
    (on-table b165)
    (clear b202)
    (on b202 b212)
    (on b212 b13)
    (on b13 b7)
    (on b7 b263)
    (on b263 b268)
    (on b268 b258)
    (on b258 b135)
    (on b135 b6)
    (on b6 b1)
    (on b1 b87)
    (on-table b87)
    (clear b166)
    (on b166 b42)
    (on-table b42)
    (clear b182)
    (on-table b182)
    (clear b181)
    (on b181 b190)
    (on-table b190)
    (clear b48)
    (on-table b48)
    (clear b235)
    (on b235 b118)
    (on-table b118)
    (clear b23)
    (on-table b23)
    (clear b22)
    (on b22 b86)
    (on-table b86)
    (clear b82)
    (on b82 b179)
    (on-table b179)
    (clear b262)
    (on b262 b209)
    (on b209 b249)
    (on b249 b255)
    (on b255 b170)
    (on-table b170)
    (clear b196)
    (on-table b196))
 (:goal  (and 
    (clear b1)
    (on-table b1)
    (clear b4)
    (on b4 b3)
    (on b3 b8)
    (on b8 b2)
    (on b2 b7)
    (on b7 b6)
    (on b6 b5)
    (on-table b5))))

; plan
1. (unstack b202 b212)
   deleted: (on b202 b212) (clear b202) (arm-empty)
   added: (holding b202) (clear b212)
   goals met: 0 of 10
2. (putdown b202)
   deleted: (holding b202)
   added: (clear b202) (arm-empty) (on-table b202)
   goals met: 0 of 10
3. (unstack b212 b13)
   deleted: (on b212 b13) (clear b212) (arm-empty)
   added: (holding b212) (clear b13)
   goals met: 0 of 10
4. (putdown b212)
   deleted: (holding b212)
   added: (clear b212) (arm-empty) (on-table b212)
   goals met: 0 of 10
5. (unstack b13 b7)
   deleted: (on b13 b7) (clear b13) (arm-empty)
   added: (holding b13) (clear b7)
   goals met: 0 of 10
6. (putdown b13)
   deleted: (holding b13)
   added: (clear b13) (arm-empty) (on-table b13)
   goals met: 0 of 10
7. (unstack b221 b96)
   deleted: (on b221 b96) (clear b221) (arm-empty)
   added: (holding b221) (clear b96)
   goals met: 0 of 10
8. (putdown b221)
   deleted: (holding b221)
   added: (clear b221) (arm-empty) (on-table b221)
   goals met: 0 of 10
9. (unstack b256 b172)
   deleted: (on b256 b172) (clear b256) (arm-empty)
   added: (holding b256) (clear b172)
   goals met: 0 of 10
10. (putdown b256)
   deleted: (holding b256)
   added: (clear b256) (arm-empty) (on-table b256)
   goals met: 0 of 10
11. (unstack b172 b5)
   deleted: (on b172 b5) (clear b172) (arm-empty)
   added: (holding b172) (clear b5)
   goals met: 0 of 10
12. (putdown b172)
   deleted: (holding b172)
   added: (clear b172) (arm-empty) (on-table b172)
   goals met: 0 of 10
13. (unstack b5 b126)
   deleted: (on b5 b126) (clear b5) (arm-empty)
   added: (holding b5) (clear b126)
   goals met: 0 of 10
14. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 1 of 10
15. (unstack b61 b185)
   deleted: (on b61 b185) (clear b61) (arm-empty)
   added: (holding b61) (clear b185)
   goals met: 1 of 10
16. (putdown b61)
   deleted: (holding b61)
   added: (clear b61) (arm-empty) (on-table b61)
   goals met: 1 of 10
17. (unstack b185 b2)
   deleted: (on b185 b2) (clear b185) (arm-empty)
   added: (holding b185) (clear b2)
   goals met: 1 of 10
18. (putdown b185)
   deleted: (holding b185)
   added: (clear b185) (arm-empty) (on-table b185)
   goals met: 1 of 10
19. (unstack b89 b152)
   deleted: (on b89 b152) (clear b89) (arm-empty)
   added: (holding b89) (clear b152)
   goals met: 1 of 10
20. (putdown b89)
   deleted: (holding b89)
   added: (clear b89) (arm-empty) (on-table b89)
   goals met: 1 of 10
21. (unstack b152 b3)
   deleted: (on b152 b3) (clear b152) (arm-empty)
   added: (holding b152) (clear b3)
   goals met: 1 of 10
22. (putdown b152)
   deleted: (holding b152)
   added: (clear b152) (arm-empty) (on-table b152)
   goals met: 1 of 10
23. (unstack b96 b264)
   deleted: (on b96 b264) (clear b96) (arm-empty)
   added: (holding b96) (clear b264)
   goals met: 1 of 10
24. (putdown b96)
   deleted: (holding b96)
   added: (clear b96) (arm-empty) (on-table b96)
   goals met: 1 of 10
25. (unstack b264 b73)
   deleted: (on b264 b73) (clear b264) (arm-empty)
   added: (holding b264) (clear b73)
   goals met: 1 of 10
26. (putdown b264)
   deleted: (holding b264)
   added: (clear b264) (arm-empty) (on-table b264)
   goals met: 1 of 10
27. (unstack b73 b95)
   deleted: (on b73 b95) (clear b73) (arm-empty)
   added: (holding b73) (clear b95)
   goals met: 1 of 10
28. (putdown b73)
   deleted: (holding b73)
   added: (clear b73) (arm-empty) (on-table b73)
   goals met: 1 of 10
29. (unstack b95 b142)
   deleted: (on b95 b142) (clear b95) (arm-empty)
   added: (holding b95) (clear b142)
   goals met: 1 of 10
30. (putdown b95)
   deleted: (holding b95)
   added: (clear b95) (arm-empty) (on-table b95)
   goals met: 1 of 10
31. (unstack b142 b136)
   deleted: (on b142 b136) (clear b142) (arm-empty)
   added: (holding b142) (clear b136)
   goals met: 1 of 10
32. (putdown b142)
   deleted: (holding b142)
   added: (clear b142) (arm-empty) (on-table b142)
   goals met: 1 of 10
33. (unstack b136 b29)
   deleted: (on b136 b29) (clear b136) (arm-empty)
   added: (holding b136) (clear b29)
   goals met: 1 of 10
34. (putdown b136)
   deleted: (holding b136)
   added: (clear b136) (arm-empty) (on-table b136)
   goals met: 1 of 10
35. (unstack b29 b177)
   deleted: (on b29 b177) (clear b29) (arm-empty)
   added: (holding b29) (clear b177)
   goals met: 1 of 10
36. (putdown b29)
   deleted: (holding b29)
   added: (clear b29) (arm-empty) (on-table b29)
   goals met: 1 of 10
37. (unstack b177 b8)
   deleted: (on b177 b8) (clear b177) (arm-empty)
   added: (holding b177) (clear b8)
   goals met: 1 of 10
38. (putdown b177)
   deleted: (holding b177)
   added: (clear b177) (arm-empty) (on-table b177)
   goals met: 1 of 10
39. (unstack b3 b83)
   deleted: (on b3 b83) (clear b3) (arm-empty)
   added: (holding b3) (clear b83)
   goals met: 1 of 10
40. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 1 of 10
41. (unstack b83 b4)
   deleted: (on b83 b4) (clear b83) (arm-empty)
   added: (holding b83) (clear b4)
   goals met: 2 of 10
42. (putdown b83)
   deleted: (holding b83)
   added: (clear b83) (arm-empty) (on-table b83)
   goals met: 2 of 10
43. (unstack b7 b263)
   deleted: (on b7 b263) (clear b7) (arm-empty)
   added: (holding b7) (clear b263)
   goals met: 2 of 10
44. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 2 of 10
45. (unstack b263 b268)
   deleted: (on b263 b268) (clear b263) (arm-empty)
   added: (holding b263) (clear b268)
   goals met: 2 of 10
46. (putdown b263)
   deleted: (holding b263)
   added: (clear b263) (arm-empty) (on-table b263)
   goals met: 2 of 10
47. (unstack b268 b258)
   deleted: (on b268 b258) (clear b268) (arm-empty)
   added: (holding b268) (clear b258)
   goals met: 2 of 10
48. (putdown b268)
   deleted: (holding b268)
   added: (clear b268) (arm-empty) (on-table b268)
   goals met: 2 of 10
49. (unstack b258 b135)
   deleted: (on b258 b135) (clear b258) (arm-empty)
   added: (holding b258) (clear b135)
   goals met: 2 of 10
50. (putdown b258)
   deleted: (holding b258)
   added: (clear b258) (arm-empty) (on-table b258)
   goals met: 2 of 10
51. (unstack b135 b6)
   deleted: (on b135 b6) (clear b135) (arm-empty)
   added: (holding b135) (clear b6)
   goals met: 2 of 10
52. (putdown b135)
   deleted: (holding b135)
   added: (clear b135) (arm-empty) (on-table b135)
   goals met: 2 of 10
53. (unstack b6 b1)
   deleted: (on b6 b1) (clear b6) (arm-empty)
   added: (holding b6) (clear b1)
   goals met: 3 of 10
54. (stack b6 b5)
   deleted: (clear b5) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b5)
   goals met: 4 of 10
55. (pickup b7)
   deleted: (clear b7) (on-table b7) (arm-empty)
   added: (holding b7)
   goals met: 4 of 10
56. (stack b7 b6)
   deleted: (clear b6) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b6)
   goals met: 5 of 10
57. (unstack b2 b75)
   deleted: (on b2 b75) (clear b2) (arm-empty)
   added: (holding b2) (clear b75)
   goals met: 5 of 10
58. (stack b2 b7)
   deleted: (clear b7) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b7)
   goals met: 6 of 10
59. (unstack b1 b87)
   deleted: (on b1 b87) (clear b1) (arm-empty)
   added: (holding b1) (clear b87)
   goals met: 5 of 10
60. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 7 of 10
61. (unstack b8 b80)
   deleted: (on b8 b80) (clear b8) (arm-empty)
   added: (holding b8) (clear b80)
   goals met: 7 of 10
62. (stack b8 b2)
   deleted: (clear b2) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b2)
   goals met: 8 of 10
63. (pickup b3)
   deleted: (clear b3) (on-table b3) (arm-empty)
   added: (holding b3)
   goals met: 8 of 10
64. (stack b3 b8)
   deleted: (clear b8) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b8)
   goals met: 9 of 10
65. (unstack b4 b39)
   deleted: (on b4 b39) (clear b4) (arm-empty)
   added: (holding b4) (clear b39)
   goals met: 8 of 10
66. (stack b4 b3)
   deleted: (clear b3) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b3)
   goals met: 10 of 10
